pegasus/test/wetest/wsman/Pull/Pull_Success05.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
            xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" 
            xmlns:wse="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
            xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
<s:Header><a:To>http://localhost/wsman</a:To>
<w:ResourceURI s:mustUnderstand="true">
  http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/WsmLarge
</w:ResourceURI>
<a:ReplyTo>
  <a:Address s:mustUnderstand="true">
    http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
  </a:Address>
</a:ReplyTo>
<a:Action s:mustUnderstand="true">
  http://schemas.xmlsoap.org/ws/2004/09/enumeration/Pull
</a:Action>
<w:MaxEnvelopeSize s:mustUnderstand="true">8300</w:MaxEnvelopeSize>
<a:MessageID>uuid:00000000-0000-0000-0005-000000000001</a:MessageID>
<w:Locale xml:lang="en-US" s:mustUnderstand="false" />
<w:SelectorSet>
<w:Selector Name="__cimnamespace">test/WsmTest</w:Selector>
</w:SelectorSet>
<w:OperationTimeout>PT60.000S</w:OperationTimeout>
</s:Header>
<s:Body>
<wse:Pull>
<wse:EnumerationContext>9</wse:EnumerationContext>
<wse:MaxElements>50</wse:MaxElements>
</wse:Pull>
</s:Body>
</s:Envelope>
